case_cylinder_kOmegaSST/0.default/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    inlet		// will be over-written by the mapped values
    {
        type            fixedValue;
        value           uniform 999999;
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            slip;
    }


    roughCylinder
    {
        type            kqRWallFunction;
        value           uniform 0; 
    }

    bottom
    {
        type            kqRWallFunction;
        value           uniform 0; 
    }
 
    sideWall
    {
        type            kqRWallFunction;
        value           uniform 0; 
    }
}


// ************************************************************************* //
